{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dtype": "int32", "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "name": "embedding_2", "input_dim": 20000, "activity_regularizer": null, "embeddings_regularizer": null, "trainable": true, "output_dim": 64, "input_length": 200, "mask_zero": false, "batch_input_shape": [null, 200]}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"activation": "tanh", "return_sequences": false, "units": 32, "recurrent_dropout": 0.0, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "kernel_constraint": null, "stateful": false, "recurrent_constraint": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "activity_regularizer": null, "use_bias": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "unit_forget_bias": true, "bias_constraint": null, "dropout": 0.0, "go_backwards": false}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "sigmoid", "units": 1, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.4"}